import '../data/question_model.dart';

class AppQuestions {
  static List<Question> fetchQuestions() {
    return [
      Question(
        question: "ما المقصود بالتنمية المستدامة؟",
        choices: [
          "تطوير المجتمعات مع مراعاة احتياجات الحاضر والمستقبل",
          "لتركيز فقط على التنمية الاقتصادية",
          "استغلال الموارد الطبيعية دون قيود",
          "تحقيق النمو الاقتصادي بغض النظر عن الأثر البيئي"
        ],
        answerIndex: 0,
      ),
      Question(
        question: "أي من الأهداف التالية لا يُعتبر من أهداف التنمية المستدامة؟",
        choices: [
          "القضاء على الفقر ",
          "تعزيز النزاعات المسلحة",
          "تحقيق المساواة بين الجنسين",
          "الوصول إلى مياه نظيفة",
        ],
        answerIndex: 1,
      ),
      Question(
        question: "لماذا تُعد التنمية المستدامة ضرورية؟",
        choices: [
         "للحفاظ على الموارد للأجيال القادمة",
         "لتعزيز استغلال الموارد دون قيود",
         "لزيادة الإنتاج الصناعي فقط",
         "لتقليل عدد السكان في العالم",
        ],
        answerIndex: 0,
      ),
      Question(
        question: "من الفئات المستهدفة في مشاريع التنمية المستدامة؟",
        choices: [
         "الشباب والمرأة",
         "المسؤولون الحكوميون فقط",
         "أصحاب الشركات الكبيرة فقط",
         "السياح والزوار",
        ],
        answerIndex: 0,
      ),
      Question(
        question: "كيف تساهم التنمية المستدامة في تحسين الاقتصاد؟",
        choices: [
         "من خلال توفير فرص العمل وتعزيز النمو الاقتصادي",
         "عبر تقليل الإنتاج الصناعي",
         "من خلال فرض قيود على المشاريع التجارية",
         "عن طريق إلغاء الضرائب",
        ],
        answerIndex: 0,
      ),
      Question(
        question: "أي من هذه العوامل يُعتبر أساسياً لتحقيق التنمية المستدامة؟",
        choices: [
         "التوازن بين الاقتصاد والبيئة والعدالة الاجتماعية",
         "زيادة الإنتاج دون الاهتمام بالبيئة",
         " تحقيق الأرباح بغض النظر عن التأثيرات السلبية",
         "تركيز الاستثمار على الصناعات الثقيلة فقط",
        ],
        answerIndex: 0,
      ),
      Question(
        question: "أي من هذه العوامل يُسهم في التدهور البيئي؟",
        choices: [
         " استخدام مصادر الطاقة المتجددة",
         "الإفراط في استغلال الموارد الطبيعية",
         "إعادة التدوير والتشجير",
         " اعتماد وسائل النقل المستدامة",
        ],
        answerIndex: 1,
      ),
      Question(
        question: "كيف تساعد التنمية المستدامة في مواجهة الأزمات؟",
        choices: [
         "من خلال بناء القدرة على التكيف والانتعاش الاقتصادي",
         "عبر الاعتماد على المساعدات الخارجية فقط",
         "من خلال إيقاف جميع المشاريع التنموية",
         "عن طريق تقليل فرص العمل",
        ],
        answerIndex: 0,
      ),
      Question(
        question: "ما العلاقة بين التنمية المستدامة والمساواة الاجتماعية؟",
        choices: [
         " تهدف التنمية المستدامة إلى تحقيق العدل بين جميع فئات المجتمع",
         " تُركز فقط على تحسين أوضاع الأغنياء",
         "تهدف إلى تحقيق العدالة بين الرجال فقط",
         " تُشجع على التمييز بين الطبقات الاجتماعية",
        ],
        answerIndex: 0,
      ),
      Question(
        question: "ما هو أحد الأهداف النهائية للتنمية المستدامة؟",
        choices: [
         " تحقيق السلام وتعزيز المؤسسات القوية",
         "زيادة استهلاك الموارد دون قيود",
         " القضاء على المشاريع البيئية",
         " تقليل فرص التعليم للجميع",
        ],
        answerIndex: 0,
      ),

    ];
  }
}
